package commands;

import interfaces.MenuItem;

public class MoreHelp implements MenuItem {
    @Override
    public void execute() {
        StringBuilder sb = new StringBuilder();
        sb.append("The following commands are supported:\n");
        sb.append("enroll <fn> <program> <group> <name>   записване на студент с име <name>в 1 курс на специалност <program>в група <group>и с факултетен номер <fn>.\n");
        sb.append("advance <fn>                           записва студент в следващ курс \n");
        sb.append("change <fn> <option> <value>           <option>е едно от program, group, year.Прехвърля студента с факултетен номер <fn>в нова специалност (program), група (group) или курс (year) зададени чрез <value>.Прехвърлянето в група е възможно винаги.Прехвърлянето в следващ курс е възможно само, ако студентът е положил успешно изпитите по всички задължителни предмети от " + "Страница 7от 8минали курсове, с евентуално изключение на максимум два курса. Прехвърляне в курс, различен от следващия, не е възможно.Прехвърлянето в друга специалност е възможно само, ако студентът е положил успешно изпити по всички задължителни предмети от минали курсове на новата специалност.\n");
        sb.append("graduate <fn>                          Отбелязва студента като завършил, но само ако е положил успешно изпити по всички записани предмети.\n");
        sb.append("interrupt <fn>                         Маркира студента с факултетен номер <fn>като прекъснал. Прекъсналите студенти не могат да се явяват на изпити, да записват учебни дисциплини или да сменят специалност, група или курс.\n");
        sb.append("resume<fn>                             Възстановява студентските права на студента с факултетен номер <fn>.\n");
        sb.append("print <fn>                             Извежда справка за студента с факултетен номер <fn>.\n");
        sb.append("printall <program> <year>              Извежда справка за всички студенти в дадена специалност и курс.\n");
        sb.append("enrollin <fn> <course>                 Записва студента с факултетен номер <fn> вдисциплината с име <course>. Записването е позволено само на дисциплини от съответния курс и специалност.\n");
        sb.append("addgrade <fn> <course> <grade>         Добавя оценка <grade>по дисциплината <course>на студента с факултетен номер <fn>. Явяването на изпит е позволено само за дисциплини, които са записани.\n");
        sb.append("protocol <course>                      Записва студента с факултетен номер <fn> вдисциплината с име <course>. Записването е позволено само на дисциплини от съответния курс и специалност.\n");
        sb.append("protocol <course>                      Извежда протоколи за всички студенти, записани в дадена дисциплина <course>. За всяка специалност и курс се извежда отделен протокол. Студентите в протокола са подредени по факултетен номер в нарастващ ред.\n");
        sb.append("report <fn>                            Извежда академична справка за оценките на даден студент (списък с всички взети изпити, съответните оценки и успех на студента). Да се включи също и списък с невзетите изпити (дисциплини, които са записани, но за тях няма оценки, те да се включат в пресмятането на средния успех на студента като двойки), ако има такива.");
        System.out.println(sb);
    }

    @Override
    public void execute(String command) {

    }
}
